In [1]:
# apply, map, .tolist(), split(), Lambda functions

In [2]:
# dependencies

import pandas as pd
import numpy as np
import requests
import matplotlib.pyplot as plt

In [3]:
# import data 

titanic_data = pd.read_csv("http://bit.ly/kaggletrain")
df = pd.DataFrame(titanic_data)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# using map - allows you map a series value to a different value

df["Sex_binary"] = df.Sex.map({"female":0, "male":1})
df.loc[0:4, ["Sex", "Sex_binary"]]

      Sex  Sex_binary
0    male           1
1  female           0
2  female           0
3  female           0
4    male           1

In [7]:
df["Pclass"].unique()

array([3, 1, 2])

In [10]:
df["Class"] = df.Pclass.map({3 : "Commerical", 2 : "Business", 1 : "First"})

In [11]:
df.sample(n=3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_binary,Class
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.525,C45,C,0,First
198,199,1,3,"Madigan, Miss. Margaret ""Maggie""",female,NaN,0,0,370370,7.750,NaN,Q,0,Commerical
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.750,NaN,Q,1,Commerical

In [12]:
# apply - both a Df and Series method

In [13]:
df["Name_length"] = df.Name.apply(len)

In [14]:
df.loc[0:4, ["Name", "Name_length"]]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [15]:
df.Name.str.split(" , ").head()

0                            [Braund, Mr. Owen Harris]
1    [Cumings, Mrs. John Bradley (Florence Briggs T...
2                             [Heikkinen, Miss. Laina]
3       [Futrelle, Mrs. Jacques Heath (Lily May Peel)]
4                           [Allen, Mr. William Henry]
Name: Name, dtype: object

In [16]:
def get_element(my_list, position):
    return my_list[position]

In [17]:
df.Name.str.split(" , ").apply(get_element, position=0).head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [18]:
df["Name"].str.split(",").apply(lambda x: x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [19]:
# apply as a DF method

drinks = pd.read_csv("http://bit.ly/drinksbycountry")
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [44]:
# .tolist()

brewskis = drinks["beer_servings"].tolist()
len(brewskis)

193

In [23]:
# axis=0 is the down direction -> apply x function downwards

drinks.loc[:, "beer_servings" : "wine_servings"].apply(max, axis=0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [24]:
# axis=1 applies across the rows -> apply x function across ->

drinks.loc[:,"beer_servings": "wine_servings"].apply(max, axis=1)

0        0
1      132
2       25
3      312
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Length: 193, dtype: int64

In [25]:
# FUNCTIONS #### FUNCTIONS ##### FUNCTIONS

In [26]:
# basic function

def f(x):
    return 3*x+1

In [27]:
f(3)

10

In [31]:
# lambda version
p = lambda x: 3*x+1

In [32]:
p(3)

10

In [33]:
# .title() capitalizes the first word

full_name = lambda first, last: first.strip().title() + " " + last.strip().title()

In [35]:
full_name("la'carpatron", "DUKEMARRIOT")

"La'Carpatron Dukemarriot"

In [ ]:
# Lambda x1,x2...xn : <expression> | the <expression> is the return value

In [37]:
add5 = lambda x: x+5
print(add5(7))  # the "7" replaces the "x" above in the argument and then the expression acts upon it

12

In [38]:
ten= 10

add10 = lambda x: x+5
print(add10(ten))

15

TypeError: '>' not supported between instances of 'list' and 'int'